Revit 2026 API

# RebarShapeConstraintProjectedSegmentLength Class

---

A constraint that measures the length of a segment as measured by projecting onto a direction that is not parallel to the segment.

SystemObject Autodesk.Revit.DB.StructureRebarShapeConstraint Autodesk.Revit.DB.StructureRebarShapeConstraintProjectedSegmentLength

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RebarShapeConstraintProjectedSegmentLength : RebarShapeConstraint
```
```vb
Public Class RebarShapeConstraintProjectedSegmentLength
	Inherits RebarShapeConstraint
```
```cpp
public ref class RebarShapeConstraintProjectedSegmentLength : public RebarShapeConstraint
```
```fsharp
type RebarShapeConstraintProjectedSegmentLength =
    class
        inherit RebarShapeConstraint
    end
```

The RebarShapeConstraintProjectedSegmentLength type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | RebarShapeConstraintProjectedSegmentLength | Constructs a new instance of a RebarConstraintProjectEdgedLength object using a shape parameter, direction, and reference types. |

|  | Name | Description |
| --- | --- | --- |
|  | Direction | A vector specifying the direction of the constraint. The direction is fixed, and the shape is always constructed so that the segment direction has a positive dot product with this vector. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RebarShapeConstraint) |
|  | TripleProductSign | Sign of the z-coordinate of the cross product of the Direction property with the segment vector. TripleProductSign is 1 if the segment direction is to be on the left of the constraint direction, or -1 if the segment direction is to be on the right. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from RebarShapeConstraint) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetParamId | Return the Id of the parameter associated with this constraint. (Inherited from RebarShapeConstraint) |
|  | GetSegmentEndReferenceType | Choice of two possibilities for the start and end references of the length constraint. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

The constraint has two references, indexed by 0 and 1, that do not have to correspond to the start and end of the segment. The constraint also specifies a direction as a 2D vector, which is not necessarily parallel to the segment, but must point from the segment's start toward its end.

#### Reference

Autodesk.Revit.DB.Structure Namespace